tap "nikitabobko/tap"
tap "notwadegrimridge/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Interactive environments for writing and running code
brew "jupyterlab"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Keyboard customizer
cask "karabiner-elements"
# Developer platform
cask "dotnet-sdk"
# Desktop application for JupyterLab
cask "jupyterlab-app"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Control where notifications appear on your screen.
cask "notwadegrimridge/brew/pingplace"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
npm "eas-cli"
npm "expo-cli"
